<?php
// Laravelの特徴
// コードが読みやすく、描きやすい
// 学習コストの安さ
// 強力なルーティングフィルター
// 柔軟なオートローダー(バックアップ装置)
// 簡単なページネーション
// （長くなった文章を複数のページに分割して、情報を読み取りやすくするナビゲーション）
// ビューをサポートするコンポーザー

// ls -a ファイル名の先頭にピリオドがあるファイルも表示される
// ls -l ファイルの詳細を表示
// 左から、ファイルタイプ、パーミション、ハードリンクの数、オーナー名、グループ名、
// バイトサイズ、タイムスタンプ、ファイル名となっている
// ls -1 縦に並べる
// ls -r 逆順で表示する
// ls -t 更新時間ごとにファイルを並び替える
// ls -s ファイルサイズ順でソートする
// ls -x ファイルを拡張子ごとにまとめる
// ls -R 一括でディレクトリ内の情報を表示
// ls --full-time タイムスタンプの詳細を表示
// ls -m ファイル名をカンマで区切って表示
// ls -h 単位を読みやすい形式で表示、容量を表示
// ls -k キロバイトで表示（単位を揃えて表示していときに使用）
// ls -i i-node番号を左側に表示してくれる
// ls -F 情報の付加
// ls --help

// echo 好きな文字列　> ファイル名
// 上記実施でファイルに上書き（前のデータが消えるので注意）
// > を >> にする事で追記する事ができる

//cat ファイル名でファイルの中身をターミナル上で表示
//cat ファイル名　> 別のファイル名　で出力内容を記述（上書き）
//上記 >> に変更で上書きではなく追加記述

//catコマンドによるファイルの結合
//cat ファイル名　ファイル名　でファイルを結合　※ファイルを並べるだけ結合できる

//cat -n ファイル名　ファイル名に行番号をつけて出力

//cat -b ファイル名　空白行には数字をつけずに行番号を出力

//cat -s ファイル名　連続した空白行を１行にまとめる（複数行を1行に）

//cat -E ファイル名　各行の最後に＄を表示するオプション（改行位置をわかりやすくするため）


//lessコマンド　catと同じように使用。長い文章を読みたいときにはこちらの方が便利










 ?>
課題4追加してからcatで確認
